In [10]:
import pandas as pd
pd.read_excel('/Users/charleslaminemane/Library/CloudStorage/OneDrive-Personnel/Classeur SET 2.xlsx')

    Name       Batch  RollNo      Noida
0  Allen  python-023       1      Noida
1    Bob    java-002      23      Dehli
2  Suzan  python-023      45  Bangalore

In [11]:
pd.read_csv('/Users/charleslaminemane/Library/CloudStorage/OneDrive-Personnel/Classeur SET 2 TEST.csv')

         Name;Batch;RollNo;Noida
0       Allen;python-023;1;Noida
1          Bob;java-002;23;Dehli
2  Suzan;python-023;45;Bangalore
3        Allex;java-002;67;Noida
4     Praksh;python-023;25;Dehli

In [12]:
pd.read_csv('/Users/charleslaminemane/Library/CloudStorage/OneDrive-Personnel/Classeur SET 2 TEST.csv')

         Name;Batch;RollNo;Noida
0       Allen;python-023;1;Noida
1          Bob;java-002;23;Dehli
2  Suzan;python-023;45;Bangalore
3        Allex;java-002;67;Noida
4     Praksh;python-023;25;Dehli

In [13]:
pd.read_csv('/Users/charleslaminemane/Library/CloudStorage/OneDrive-Personnel/Classeur SET 2 TEST.csv')

         Name;Batch;RollNo;Noida
0       Allen;python-023;1;Noida
1          Bob;java-002;23;Dehli
2  Suzan;python-023;45;Bangalore
3        Allex;java-002;67;Noida
4     Praksh;python-023;25;Dehli

In [24]:
pd.read_csv(r'/Users/charleslaminemane/Library/CloudStorage/OneDrive-Personnel/Classeur SET 2 TEST 1.csv')

         Name;Batch;RollNo;Noida
0       Allen;python-023;1;Noida
1          Bob;java-002;23;Dehli
2  Suzan;python-023;45;Bangalore
3        Allex;java-002;67;Noida
4     Praksh;python-023;25;Dehli

In [20]:
pd.read_excel('/Users/charleslaminemane/Library/CloudStorage/OneDrive-Personnel/Classeur SET 2 TEST 3.xls')

     Name       Batch  RollNo      Noida
0   Allen  python-023       1      Noida
1     Bob    java-002      23      Dehli
2   Suzan  python-023      45  Bangalore
3   Allex    java-002      67      Noida
4  Praksh  python-023      25      Dehli

In [25]:
import pandas as pd

In [26]:
pd.read_excel('/Users/charleslaminemane/Library/CloudStorage/OneDrive-Personnel/MyexcelData.xlsx')

      Name      Batch  Rollno Grade
0    Manoj  python-09      78     A
1    Suyog  python-09      34    A+
2   Chitan  python-09      67     O
3  Prakash  python-09      89   A++